#!/bin/bash
# ==========================================
# mini-redis 动态数组性能测试脚本
# 目标：感受 O(n) 查找随着数据量增长而变慢
# ==========================================


echo "=========================================="
echo "  动态数组 O(n) 性能测试"
echo "=========================================="
echo ""

# ---------- 插入 1000 个 key ----------
echo "=== 1. 插入 10000 个 key(SET) ==="
time for i in $(seq 1 10000);do  #time：统计整个循环执行耗时,do开始循环
    #for i in $(seq 1 1000)：循环 1000 次，i 从 1 变到 1000

    # 发送 RESP 命令
    # 构造 RESP 命令：SET key_0001 value ... SET key_1000 value
    # printf 格式化：key_%04d 会把 1 变成 key_0001，保持对齐
     redis-cli -h 127.0.0.1 -p 6379 GET key_$(printf "%04d" $i) > /dev/null
    #  > /dev/null：不输出任何结果，安静执行

done #结束循环
echo ""

# ---------- 随机查询 1000 次 ----------
echo "=== 2. 随机查询 10000 次(GET) ==="
time for i in $(seq 1 10000);do
    # 随机生成 1~1000 之间的 key_id
    key_id=$((RANDOM %1000 +1))
    #RANDOM：bush系统生成一个随机数
    #% 1000：取余，让范围变成 0~999
    #+1:最终变成 1 ~ 1000 的随机数
    #作用：每次都随机查一个 key，不是顺序查
     redis-cli -h 127.0.0.1 -p 6379 GET key_$(printf "%04d" $key_id) > /dev/null
    
done
echo ""

echo "=== 测试完成 ==="
echo "提示：记录上面的 real 时间，那是真实耗时。"
